mridulp-jft/telecom-gps/NUC230_240 Series BSP CMSIS V3.01.001/SampleCode/RegBased/CAN_Test_MaskFilter/main.c
/****************************************************************************
 * @file     main.c
 * @version  V2.0
 * $Revision: 2 $
 * $Date: 4/15/15 11:45a $
 * @brief    NUC230_240 Series CAN Driver Sample Code
 *
 * @note
 * Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
 *
 ******************************************************************************/
#include <stdio.h>
#include "NUC230_240.h"


#define PLLCON_SETTING  CLK_PLLCON_72MHz_HXT
#define PLL_CLOCK       72000000


#define FILTER 0x240


/*---------------------------------------------------------------------------*/
/*  Function Declare                                                         */
/*---------------------------------------------------------------------------*/
extern char GetChar(void);
void CAN_CLR_INT_PENDING_BIT(CAN_T *tCAN, uint8_t u32MsgNum);
int32_t CAN_ReadMsgObj(CAN_T *tCAN, uint8_t u8MsgObj, STR_CANMSG_T* pCanMsg);
void CAN_MsgInterrupt(CAN_T *tCAN, uint32_t u32IIDR);
void CAN_ResetIF(CAN_T *tCAN, uint8_t u8IF_Num);
void CAN_ShowMsg(STR_CANMSG_T* Msg);
void SYS_Init(void);
void UART0_Init(void);
void Note_Configure(void);
void TestItem(void);
void CAN_Init(CAN_T *tCAN, uint32_t u32kbps);
uint32_t GetCANBitRate(CAN_T  *tCAN);
void SelectCANSpeed(CAN_T  *tCAN);
void CAN_STOP(void);
static uint32_t CAN_GetFreeIF(CAN_T *tCAN);
int32_t CAN_SetTxMsgObj(CAN_T *tCAN, uint8_t u8MsgObj, STR_CANMSG_T* pCanMsg);
uint32_t CAN_SetTxRqst(CAN_T *tCAN, uint8_t u8MsgObj);
void Test_TestMaskFilter(CAN_T *tCAN);
int32_t CAN_SetMsgObjMask(CAN_T *tCAN, uint8_t u8MsgObj, STR_CANMASK_T* MaskMsg);
int32_t CAN_SetRxMsgObj(CAN_T  *tCAN, uint8_t u8MsgObj, uint8_t u8idType, uint32_t u32id, uint8_t u8singleOrFifoLast);
__INLINE void initialization();

/*---------------------------------------------------------------------------*/
/*  Callback function                                                        */
/*---------------------------------------------------------------------------*/

/* Declare a CAN message structure */
STR_CANMSG_T rrMsg;
int32_t i32id = 0;
STR_CANMSG_T tMsg;
STR_CANMASK_T MaskMsg;

CAN_T *tCAN;
CAN_T *tCAN1;


/*---------------------------------------------------------------------------------------------------------*/
/* MAIN function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
int main(void)
{

    tCAN = (CAN_T *) CAN0;
    tCAN1 = (CAN_T *) CAN1;
		
		initialization();
    /* Use Message Object No.1 to send ID=0x700~0x70F */
    /* Set b'0' means don't care*/
    /* Set Message Object No.0 mask ID */
    MaskMsg.u8Xtd    = 0;               /* 1: 29-bit Extended Identifier or 0:11-bit Standard Identifier */
    MaskMsg.u8Dir    = 1;               /* 1:Direction is transmit or 0:Direction is receive*/
    MaskMsg.u8IdType = 0;       /* 1: 29-bit Extended Identifier or 0:11-bit Standard Identifier */
    MaskMsg.u32Id    = 0;       /* Set the Message Identifier  */

    /* Configures Mask as the message object */
//    CAN_SetMsgObjMask(tCAN1, MSG(0), &MaskMsg);

////    /* Set Rx message object */
//    CAN_SetRxMsgObj(tCAN1, MSG(0), CAN_STD_ID, 0x7FF , TRUE);

//		CAN_SetMsgObjMask(tCAN, MSG(0), &MaskMsg);

//    /* Set Rx message object */
//    CAN_SetRxMsgObj(tCAN, MSG(0), CAN_STD_ID, 0x7FF , TRUE);	
//	
//    /* Enable CAN interrupt */
//    tCAN->CON |= CAN_CON_IE_Msk;
    tCAN1->CON |= CAN_CON_IE_Msk;

//    /* Enable corresponding NVIC of CAN */
//    NVIC_EnableIRQ(CAN0_IRQn);
//    NVIC_EnableIRQ(CAN1_IRQn);

    while(1) {
        /* Send a 11-bit Standard Identifier message */
        tMsg.FrameType = CAN_DATA_FRAME;    /* Set the Frame Type */
        tMsg.IdType   = CAN_STD_ID;     /* Set the Identifier Type */
        tMsg.Id       = 0x348;  /* Set the Message Identifier  */
        tMsg.DLC      = 8;                          /* Set the Data Length Code  */
				tMsg.Data[0]  = 0x14;
				tMsg.Data[1]  = 0x03;
				tMsg.Data[2]  = 0x06;
				tMsg.Data[3]  = 0x0;
				tMsg.Data[4]  = 0x0;
				tMsg.Data[5]  = 0x0;
				tMsg.Data[6]  = 0x20;
				tMsg.Data[7]  = 0x53;
//CAN_STOP();
        /* Call CAN_SetTxMsgObj() only Configure Msg RAM */
        if(CAN_SetTxMsgObj(tCAN1, MSG(1), &tMsg) < 0) {
            printf("Set Tx Msg Object failed\n");
            return 0;
        }

//        /* Set transmit request bit */
        CAN_SetTxRqst(tCAN1, MSG(1));

        /* Check the message has been successfully transmitted */
        while((tCAN1->STATUS & CAN_STATUS_TXOK_Msk) == 0);
        /* Clear TXOK flag */
        tCAN1->STATUS &= ~CAN_STATUS_TXOK_Msk;

        /* Generate the Delay Time by Systick */
        CLK_SysTickDelay(100000);

        i32id++;
        if(i32id >= 0x10)
            i32id=0;
    printf("Transfer Done\n");

    }

    /* Disable CAN */
 //   

  //  while(1);

}

































































































/*---------------------------------------------------------------------------------------------------------*/
/* Clear interrupt pending bit                                                                             */
/*---------------------------------------------------------------------------------------------------------*/
void CAN_CLR_INT_PENDING_BIT(CAN_T *tCAN, uint8_t u32MsgNum)
{
    uint32_t u32MsgIfNum = 0;
    uint32_t u32IFBusyCount = 0;

    while(u32IFBusyCount < 0x10000000) {
        if((tCAN->IF[0].CREQ & CAN_IF_CREQ_BUSY_Msk) == 0) {
            u32MsgIfNum = 0;
            break;
        } else if((tCAN->IF[1].CREQ  & CAN_IF_CREQ_BUSY_Msk) == 0) {
            u32MsgIfNum = 1;
            break;
        }

        u32IFBusyCount++;
    }

    tCAN->IF[u32MsgIfNum].CMASK = CAN_IF_CMASK_CLRINTPND_Msk | CAN_IF_CMASK_TXRQSTNEWDAT_Msk;
    tCAN->IF[u32MsgIfNum].CREQ = 1 + u32MsgNum;

}

/*---------------------------------------------------------------------------------------------------------*/
/* Gets the message                                                                                        */
/*---------------------------------------------------------------------------------------------------------*/
int32_t CAN_ReadMsgObj(CAN_T *tCAN, uint8_t u8MsgObj, STR_CANMSG_T* pCanMsg)
{
    if(!CAN_GET_NEW_DATA_IN_BIT(tCAN, u8MsgObj)) {
        return FALSE;
    }

    tCAN->STATUS &= (~CAN_STATUS_RXOK_Msk);

    /* read the message contents*/
    tCAN->IF[1].CMASK = CAN_IF_CMASK_MASK_Msk
                        | CAN_IF_CMASK_ARB_Msk
                        | CAN_IF_CMASK_CONTROL_Msk
                        | CAN_IF_CMASK_CLRINTPND_Msk
                        | CAN_IF_CMASK_TXRQSTNEWDAT_Msk
                        | CAN_IF_CMASK_DATAA_Msk
                        | CAN_IF_CMASK_DATAB_Msk;

    tCAN->IF[1].CREQ = 1 + u8MsgObj;

    while(tCAN->IF[1].CREQ & CAN_IF_CREQ_BUSY_Msk) {
        /*Wait*/
    }

